len(data[data['curAmt']==0]) # 4784개

curAmt0 = data[data['curAmt']==0]['npayCdNm'].unique().tolist()

['제증명수수료/확인서/진료',
 '제증명수수료/진료기록사본/1~5매',
 '제증명수수료/영문진단서/일반',
 '초음파검사료/기본초음파/단순초음파/Ⅱ',
 '기능 검사료(외피, 근골 기능 검사)/동적 족저압측정',
 '한방검사료/경피온열검사/전신',
 '제증명수수료/진단서/근로능력평가용',
 '제증명수수료/진단서/일반',
 '초음파검사료/진단초음파/근골격, 연부-관절 초음파/손가락',
 '초음파검사료/유도초음파/수술 중 초음파',
 '치료재료/시아노아크릴레이트를 이용한 복재정맥 폐색술용/VENASEAL CLOSURE SYSTEM',
 '한방검사료/경피온열검사/부분',
 '이학요법료/이명재훈련치료',
 '제증명수수료/출생증명서',
 '제증명수수료/진료기록영상/필름',
 '초음파검사료/특수초음파/혈관내초음파',
 '제증명수수료/확인서/통원',
 '제증명수수료/장애인증명서',
 '제증명수수료/후유장애진단서',
 '제증명수수료/진료기록영상/CD',
 '이학요법료/도수치료',
 '치과 처치· 수술료/치석제거/전악',
 '한방 시술 및 처치료/한방물리요법',
 '예방접종료/로타바이러스/로타릭스프리필드',
 '제증명수수료/진료기록사본/6매 이상',
 '초음파검사료/기본초음파/단순초음파/Ⅰ',
 '기능 검사료(신경계 기능검사)/덴버발달검사',
 '제증명수수료/상해진단서/3주 이상',
 '제증명수수료/제증명서 사본',
 '상급병실료/3인실',
 '처치 및 수술료(근골)/자가 골수 줄기세포 치료/연골결손(동 행위를 위해 실시한 골수천자, 미세천공술 및 관절경 치료재료대 포함)',
 '제증명수수료/향후진료비추정서/천만원 미만',
 '상급병실료/1인실',
 '제증명수수료/장애 정도 심사용 진단서/신체적장애',
 '기능 검사료(신경계 기능검사)/섭식장애평가',
 '기능 검사료(순환기 기능 검사)/관상동맥내 광학파 단층촬영',
 '예방접종료/대상포진/스카이조스터주',
 '상급병실료/2인실',
 '제증명수수료/진료기록영상/DVD',
 '제증명수수료/병무용진단서',
 '제증명수수료/향후진료비추정서/천만원 이상',
 '제증명수수료/상해진단서/3주 미만',
 '제증명수수료/진료기록영상/USB',
 '제증명수수료/채용신체 검사서/일반',
 '교육상담료/당뇨병교육',
 '제증명수수료/사망진단서',
 '제증명수수료/입원사실 증명서',
 '초음파검사료/진단초음파/근골격, 연부-연부조직 초음파/일반',
 '제증명수수료/진단서/건강',
 '한방검사료/사상체질검사/QSCCII 설문지에 의한 심성검사',
 '제증명수수료/사산(사태)증명서',
 '제증명수수료/국민연금 장애 심사용 진단서',
 '한방검사료/사상체질검사/QSCCII 설문지에 의한 심성검사 및 상담',
 '한방 시술 및 처치료/약침술/경혈',
 '제증명수수료/확인서/입퇴원']

# '제증명'과 '수수료'가 들어간 항목은 빼야할 듯? 무료일 수 있다고 생각
search = "제증명"
for word in curAmt0:
  if search in word:
    curAmt0.remove(word)

search = "수수료"
for word in curAmt0:
  if search in word:
    curAmt0.remove(word)

